s='王宇建,苏红,邹存财....'

#列表 数字 list

l = ['王宇建','苏红','邹存财' ]#一维数组  二维数组 三维数组
print(l[-1]) #-1代表最后一个元素


# l3 = [1,2,3,4,["abc",'123','456'] ] #二维数组

# l4 = [1,2,3,4,["abc",'123','456',["a",'b','c']]] #二维数组


#      0       1      2

#索引、下标、角标

#list取元素的时候是根据编号取值的
print(l[0])
# print(l[1])

#增
l.append('王亚娟') #在末尾增加元素
l.insert(0,'周杰伦') #指定位置增加元素
l.insert(7,123) #如果你指定的下标没有，那么久加到最后面

#修改
l[3] = 98.987

#删除
l.pop(3)#指定下标删除
l.remove('王宇建')#指定元素删除
del l[0] #指定下标删除
print(l)

# print(l.count('王亚娟'))
# print(l.count('李巧利'))
# index = l.index('王亚娟') #找某个元素的下标
# l.reverse() #反转list
l2 = [4,5,2,24,23,3252,352,1252,235]
l2.sort(reverse=True) #排序
# l2.clear() #清空list
l3 = l + l2 #直接相加就是把两个list合并成一个list
print('L3',l3)

l.extend(l2) #把l2里面的元素加入到l里面
print('L',l)